mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Expected Args!");

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

//  xSemaphoreTake(ESP32_I2C_Master_Definition->def_mux
//    ,portMAX_DELAY);

// ------------------------------------------------------------------------------------------------

  // store FD to Definition. Will than be processed in global loop ... -> THIS MODULE USES NO FD
  ESP32_I2C_Master_Definition->common.fd = -1;

  // store table of function callbacks provided & made accessible for client modules
  ESP32_I2C_Master_Definition->ESP32_I2C_Master_Fn = &ESP32_I2C_Master_Fn;

// ------------------------------------------------------------------------------------------------

  // init WebIf_Provided offset
//  ESP32Control_Definition->common.link =
//	&ESP32Control_Definition->WebIf_Provided;

  // check for loaded Module 'WebIf' -> get provided Fn
  ESP32_I2C_Master_Definition->WebIf_Provided.WebIf_FnProvided =
	NULL;//(WebIf_FnProvided_t *) SCDEFn->GetFnProvidedByModule("WebIf");

 // Providing data for WebIf? Initialise data provided for WebIf
  if (ESP32_I2C_Master_Definition->WebIf_Provided.WebIf_FnProvided) {

	ESP32_I2C_Master_Definition->WebIf_Provided.ActiveResourcesDataA =
		(WebIf_ActiveResourcesDataA_t *) &ESP32_I2C_Master_ActiveResourcesDataA_forWebIf;

	ESP32_I2C_Master_Definition->WebIf_Provided.ActiveResourcesDataB =
		(WebIf_ActiveResourcesDataB_t *) &ESP32_I2C_Master_ActiveResourcesDataB_forWebIf;
  }

  else	{

	SCDEFn->Log3Fn(Common_Definition->name
		,Common_Definition->nameLen
		,1
		,"Could not enable WebIf support for '%.*s'. Type '%.*s' detects Type 'WebIf' is NOT loaded!"
		,ESP32_I2C_Master_Definition->common.nameLen
		,ESP32_I2C_Master_Definition->common.name
		,ESP32_I2C_Master_Definition->common.module->ProvidedByModule->typeNameLen
		,ESP32_I2C_Master_Definition->common.module->ProvidedByModule->typeName);
  }

// ------------------------------------------------------------------------------------------------

  // Parse define-args (KEY=VALUE) protocol -> gets parsedKVInput in allocated mem, NULL = ERROR
  parsedKVInputArgs_t *parsedKVInput = 
	SCDEFn->ParseKVInputArgsFn(ESP32_I2C_Master_SET_NUMBER_OF_IK		// Num Implementated KEYs MAX
	,ESP32_I2C_Master_Set_ImplementedKeys					// Implementated Keys
	,defArgsText								// our args text
	,defArgsTextLen);							// our args text len

  // parsing may report an problem. args contain: unknown keys, double keys, ...?
  if (!parsedKVInput) {

	// alloc mem for retMsg
	retMsg = malloc(sizeof(strTextMultiple_t));

	// response with error text
	retMsg->strTextLen = asprintf(&retMsg->strText
		,"Parsing Error! Args '%.*s' not taken! Check the KEYs!"
		,defArgsTextLen
		,defArgsText);

	if (parsedKVInput) {

		free(parsedKVInput);
	}

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

  // try 1 - arguments for configuration as i2c master ?

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = 	( (1 << ESP32_I2C_Master_SET_I2C_NUM)
					| (1 << ESP32_I2C_Master_SET_I2C_MODE)
					| (1 << ESP32_I2C_Master_SET_SDA_IO)
					| (1 << ESP32_I2C_Master_SET_SDA_IO_PULLUP)
					| (1 << ESP32_I2C_Master_SET_SCL_IO)
					| (1 << ESP32_I2C_Master_SET_SCL_IO_PULLUP)
					| (1 << ESP32_I2C_Master_SET_MASTER_CLOCK)
					);

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 	( (1 << ESP32_I2C_Master_SET_SLAVE_10BIT_ENA)
					| (1 << ESP32_I2C_Master_SET_SLAVE_ADRESS)
 					);
/*
  // process the set-args (key=value@) protocol
  retMsg = ESP32_I2C_Master_ProcessKVInputArgs(ESP32_I2C_Master_Definition,
		parsedKVInput,		// KVInput parsed
		defArgsText,		// our args text
		defArgsTextLen);	// our args text len*/

  // processing reports an problem. Args not taken. Return with MSG
  if (retMsg != SCDE_OK) {

	// free allocated memory for query result key-field
	free(parsedKVInput);

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

















  #if ESP32_I2C_Master_Module_DBG >= 5
  printf("|ESP32_I2C_Master_Define, installing i2c driver>");
  #endif




//Temp fill of struct

#define I2C_MASTER_NUM I2C_NUM_1   //!< I2C port number for master dev 
#define I2C_MASTER_SDA_IO    18    //!< gpio number for I2C master data  
#define I2C_MASTER_SCL_IO    19    //!< gpio number for I2C master clock 
#define I2C_MASTER_FREQ_HZ    100000     //!< I2C master clock frequency 



    ESP32_I2C_Master_Definition->i2c_num =
	I2C_MASTER_NUM;
    ESP32_I2C_Master_Definition->i2c_config.mode =
	I2C_MODE_MASTER;
    ESP32_I2C_Master_Definition->i2c_config.sda_io_num =
	I2C_MASTER_SDA_IO;
    ESP32_I2C_Master_Definition->i2c_config.sda_pullup_en =
	GPIO_PULLUP_ENABLE;
    ESP32_I2C_Master_Definition->i2c_config.scl_io_num =
	I2C_MASTER_SCL_IO;
    ESP32_I2C_Master_Definition->i2c_config.scl_pullup_en =
	GPIO_PULLUP_ENABLE;
    ESP32_I2C_Master_Definition->i2c_config.master.clk_speed =
	I2C_MASTER_FREQ_HZ;


// ------------------------------------------------------------------------------------------------

  // setup GPIOS, activate i2c, ...
  retMsg = i2c_param_config(ESP32_I2C_Master_Definition->i2c_num,
	&ESP32_I2C_Master_Definition->i2c_config);

 // error during config ? return with MSG
  if (retMsg != SCDE_OK) {

	return retMsg;
  }

// ------------------------------------------------------------------------------------------------

//zero struct?
 ESP32_I2C_Master_Definition->i2c_obj = NULL;

#define I2C_MASTER_TX_BUF_DISABLE   0   /*!< I2C master do not need buffer */
#define I2C_MASTER_RX_BUF_DISABLE   0   /*!< I2C master do not need buffer */
 printf("|2ESP32_I2C_Master_Define, installing i2c driver2>");
  // install the I2C driver
  i2c_driver_install(ESP32_I2C_Master_Definition->i2c_num,
	&ESP32_I2C_Master_Definition->i2c_obj,
	ESP32_I2C_Master_Definition->i2c_config.mode,
	I2C_MASTER_RX_BUF_DISABLE,
	I2C_MASTER_TX_BUF_DISABLE,
	0);















