mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
/*
    For i2c master mode, we don't need to use a buffer for the data, the APIs will execute the master commands
and return after all of the commands have been sent out or when error occurs. So when we send master commands,
we should free or modify the source data only after the i2c_master_cmd_begin function returns.
    For i2c slave mode, we need a data buffer to stash the sending and receiving data, because the hardware fifo
has only 32 bytes.
*/









//xxxxxxxxxxxxx entry
















/*
esp_err_t i2c_driver_install(i2c_port_t i2c_num, i2c_mode_t mode, size_t slv_rx_buf_len, size_t slv_tx_buf_len,
    int intr_alloc_flags)
{
    I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
    I2C_CHECK(mode == I2C_MODE_MASTER || ( slv_rx_buf_len > 100 || slv_tx_buf_len > 100 ), I2C_SLAVE_BUFFER_LEN_ERR_STR,
        ESP_ERR_INVALID_ARG);
*/



  // check:
  // mode			-> I2C_MODE_MASTER or I2C_MODE_SLAVE
  // i2c_num < I2C_NUM_MAX	-> 0-1
  // slv_rx_buf_len > 100	-> 0-100
  // slv_tx_buf_len > 100	-> 0-100



/*
i2c_port_t i2c_num = I2C_NUM_1;//0;
i2c_mode_t mode = I2C_MODE_MASTER;
size_t slv_rx_buf_len = I2C_MASTER_RX_BUF_DISABLE;
size_t slv_tx_buf_len = I2C_MASTER_TX_BUF_DISABLE;
int intr_alloc_flags = 0;





  // init i2c  
  uint32_t intr_mask = 0;

  i2c_obj_t *p_i2c = &ESP32_I2C_Master_Definition->i2c_obj;

  // init i2c obj
  p_i2c->i2c_num = i2c_num;
  p_i2c->mode = mode;
  p_i2c->cmd_idx = 0;
  p_i2c->rx_cnt = 0;
  p_i2c->status = I2C_STATUS_IDLE;
  p_i2c->rx_fifo_remain = I2C_FIFO_LEN;
  p_i2c->tx_fifo_remain = I2C_FIFO_LEN;

  // prepare for slave mode ? -> we use ringbuffers only in slave mode
  if (mode == I2C_MODE_SLAVE) {

    // prepare the requested RX buf length, > 0
    if (slv_rx_buf_len > 0) {
 
      p_i2c->rx_ring_buf = xRingbufferCreate(slv_rx_buf_len, RINGBUF_TYPE_BYTEBUF);

      // we got the buffer?
      if (p_i2c->rx_ring_buf == NULL) {
        ESP_LOGE(I2C_TAG, I2C_BUF_ERR_STR);
        goto err;
      }

      p_i2c->rx_buf_length = slv_rx_buf_len;

    }

    // prepare the requested RX buf length, its 0!
    else {

      p_i2c->rx_ring_buf = NULL;

      p_i2c->rx_buf_length = 0;

    }

    // prepare the requested TX buf length, > 0
    if (slv_tx_buf_len > 0) {

      p_i2c->tx_ring_buf = xRingbufferCreate(slv_tx_buf_len, RINGBUF_TYPE_BYTEBUF);

      // we got the buffer?
      if (p_i2c->tx_ring_buf == NULL) {
        ESP_LOGE(I2C_TAG, I2C_BUF_ERR_STR);
        goto err;

      }

      p_i2c->tx_buf_length = slv_tx_buf_len;

    }

    // prepare the requested TX buf length, its 0!
    else {

      p_i2c->tx_ring_buf = NULL;

      p_i2c->tx_buf_length = 0;

    }

    p_i2c->slv_rx_mux = xSemaphoreCreateMutex();
    p_i2c->slv_tx_mux = xSemaphoreCreateMutex();

    // we got the semaphores?
    if (p_i2c->slv_rx_mux == NULL || p_i2c->slv_rx_mux == NULL) {
      ESP_LOGE(I2C_TAG, I2C_SEM_ERR_STR);
      goto err;

    }

    intr_mask |= ( I2C_RXFIFO_FULL_INT_ENA_M | I2C_TRANS_COMPLETE_INT_ENA_M );
  }

  // else prepare for master mode..
  else {

    // semaphore to sync sending process, because we only have 32 bytes for hardware fifo.
    p_i2c->cmd_sem = xSemaphoreCreateBinary();
    p_i2c->cmd_mux = xSemaphoreCreateMutex();

    // we got the semaphores?
    if (p_i2c->cmd_sem == NULL || p_i2c->cmd_mux == NULL) {
      ESP_LOGE(I2C_TAG, I2C_SEM_ERR_STR);
      goto err;
    }

    // init command link
    p_i2c->cmd_link.cur = NULL;
    p_i2c->cmd_link.head = NULL;
    p_i2c->cmd_link.free = NULL;

    p_i2c->tx_ring_buf = NULL;
    p_i2c->rx_buf_length = 0;
    p_i2c->tx_ring_buf = NULL;
    p_i2c->tx_buf_length = 0;

  }

  // hook isr handler
  i2c_isr_register(i2c_num,
	i2c_isr_handler_default,
	p_i2c, //ESP32_I2C_Master_Definition
	intr_alloc_flags,
	&p_i2c->intr_handle); // an irq handle is stored here 

  intr_mask |= ( I2C_TRANS_COMPLETE_INT_ENA_M |
                 I2C_TRANS_START_INT_ENA_M |
                 I2C_ARBITRATION_LOST_INT_ENA_M |
                 I2C_ACK_ERR_INT_ENA_M |
                 I2C_RXFIFO_OVF_INT_ENA_M |
                 I2C_SLAVE_TRAN_COMP_INT_ENA_M );

  SET_PERI_REG_MASK(I2C_INT_ENA_REG(i2c_num), intr_mask);

  #if ESP32_I2C_Master_Module_DBG >= 5
  printf("|ESP32_I2C_Master_Define, i2c ready to use ..>");
  #endif
*/





/*
esp_err_t i2c_driver_delete(i2c_port_t i2c_num)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(p_i2c_obj[i2c_num] != NULL, I2C_DRIVER_ERR_STR, ESP_FAIL);
  i2c_obj_t* p_i2c = p_i2c_obj[i2c_num];

  uint32_t intr_mask = I2C_MASTER_TRAN_COMP_INT_ENA_M |
                       I2C_TIME_OUT_INT_ENA_M |
                       I2C_TRANS_COMPLETE_INT_ENA_M |
                       I2C_TRANS_START_INT_ENA_M |
                       I2C_TX_SEND_EMPTY_INT_ENA_M |
                       I2C_ARBITRATION_LOST_INT_ENA_M |
                       I2C_ACK_ERR_INT_ENA_M |
                       I2C_RXFIFO_OVF_INT_ENA_M |
                       I2C_RX_REC_FULL_INT_ENA_M |
                       I2C_SLAVE_TRAN_COMP_INT_ENA_M;

  CLEAR_PERI_REG_MASK(I2C_INT_ENA_REG(i2c_num), intr_mask);

  esp_intr_free(p_i2c->intr_handle);

  p_i2c->intr_handle = NULL;

  if (p_i2c->cmd_mux) {

	xSemaphoreTake(p_i2c->cmd_mux, portMAX_DELAY);
	vSemaphoreDelete(p_i2c->cmd_mux);
  }

  if (p_i2c->cmd_sem) {

	vSemaphoreDelete(p_i2c->cmd_sem);
  }

  if (p_i2c->slv_rx_mux) {

	vSemaphoreDelete(p_i2c->slv_rx_mux);
  }

  if (p_i2c->slv_tx_mux) {

	vSemaphoreDelete(p_i2c->slv_tx_mux);
  }

  if (p_i2c->rx_ring_buf) {

	vRingbufferDelete(p_i2c->rx_ring_buf);

	p_i2c->rx_ring_buf = NULL;
	p_i2c->rx_buf_length = 0;
  }

  if (p_i2c->tx_ring_buf) {

	vRingbufferDelete(p_i2c->tx_ring_buf);

	p_i2c->tx_ring_buf = NULL;
	p_i2c->tx_buf_length = 0;
  }

  free(p_i2c_obj[i2c_num]);
  p_i2c_obj[i2c_num] = NULL;

  return ESP_OK;
}
*/




































#define DATA_LENGTH          512  /*!<Data buffer length for test buffer*/
#define RW_TEST_LENGTH       129  /*!<Data length for r/w test, any value from 0-DATA_LENGTH*/
#define DELAY_TIME_BETWEEN_ITEMS_MS   1234 /*!< delay time between different test items */


#define BH1750_SENSOR_ADDR  0x23    /*!< slave address for BH1750 sensor */
#define BH1750_CMD_START    0x23    /*!< Command to set measure mode */
#define ESP_SLAVE_ADDR 0x28         /*!< ESP32 slave address, you can set any 7bit value */
#define WRITE_BIT  I2C_MASTER_WRITE /*!< I2C master write */
#define READ_BIT   I2C_MASTER_READ  /*!< I2C master read */
#define ACK_CHECK_EN   0x1     /*!< I2C master will check ack from slave*/
#define ACK_CHECK_DIS  0x0     /*!< I2C master will not check ack from slave */
#define ACK_VAL    0x0         /*!< I2C ack value */
#define NACK_VAL   0x1         /*!< I2C nack value */












  #if ESP32_I2C_Master_Module_DBG >= 5
  printf("|ESP32_I2C_Master_Define, installed i2c driver>");
  #endif





