mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
}
*/



















/* @brief test code to write esp-i2c-slave
 *
 * 1. set mode
 * _________________________________________________________________
 * | start | slave_addr + wr_bit + ack | write 1 byte + ack  | stop |
 * --------|---------------------------|---------------------|------|
 * 2. wait more than 24 ms
 * 3. read data
 * ______________________________________________________________________________________
 * | start | slave_addr + rd_bit + ack | read 1 byte + ack  | read 1 byte + nack | stop |
 * --------|---------------------------|--------------------|--------------------|------|
 */
/*
esp_err_t i2c_master_sensor_test(i2c_port_t i2c_num, uint8_t* data_h, uint8_t* data_l)
{
    i2c_cmd_handle_t cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | WRITE_BIT, ACK_CHECK_EN);
    i2c_master_write_byte(cmd, BH1750_CMD_START, ACK_CHECK_EN);
    i2c_master_stop(cmd);
  // part in I.O. Device
    int ret = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);
    if (ret == ESP_FAIL) {
        return ret;
    }
    vTaskDelay(30 / portTICK_RATE_MS);
    cmd = i2c_cmd_link_create();
    i2c_master_start(cmd);
    i2c_master_write_byte(cmd, BH1750_SENSOR_ADDR << 1 | READ_BIT, ACK_CHECK_EN);
    i2c_master_read_byte(cmd, data_h, ACK_VAL);
    i2c_master_read_byte(cmd, data_l, NACK_VAL);
    i2c_master_stop(cmd);
    ret = i2c_master_cmd_begin(i2c_num, cmd, 1000 / portTICK_RATE_MS);
    i2c_cmd_link_delete(cmd);
    if (ret == ESP_FAIL) {
        return ESP_FAIL;
    }
    return ESP_OK;
}
*/










/*
// ------------------------------------------------------------------------------------------------

  // set required Keys -> Keys that should be there in this request
  parsedKVInput->requiredKVBF = ( (1 << ESP32_I2C_Master_SET_I2C_NUM)
			        | (1 << ESP32_I2C_Master_SET_I2C_MODE)
			        | (1 << ESP32_I2C_Master_SET_SDA_IO)
			        | (1 << ESP32_I2C_Master_SET_SDA_IO_PULLUP)
			        | (1 << ESP32_I2C_Master_SET_SCL_IO)
			        | (1 << ESP32_I2C_Master_SET_SCL_IO_PULLUP) );

  // set forbidden Keys -> Keys that are not allowed in this request
  parsedKVInput->forbiddenKVBF = 0;

  // process the set-args (key=value@) protocol
  if (ESP32_I2C_Master_ProcessKVInputArgs(ESP32_I2C_Master_Definition
    ,parsedKVInput				// KVInput parsed
    ,defArgsText				// our args text
    ,defArgsTextLen) ) {			// our args text len

    // Processing reports an problem. Args not taken. Response with error text.

    // alloc mem for retMsg
    retMsg = malloc(sizeof(strTextMultiple_t));

    // response with error text
    retMsg->strTextLen = asprintf(&retMsg->strText
      ,"Processing Error! Args '%.*s' not taken! Check the VALUEs!"
      ,defArgsTextLen
      ,defArgsText);

    // free allocated memory for query result key-field
    free(parsedKVInput);

    return retMsg;
  }

// ------------------------------------------------------------------------------------------------
*/
  // set affected readings
 // ESP32_I2C_Master_SetAffectedReadings(ESP32_I2C_Master_Definition
  //  ,parsedKVInput->affectedReadingsBF);

// ------------------------------------------------------------------------------------------------

  // free allocated memory for query result key-field
  //free(parsedKVInput);


// ------------------------------------------------------------------------------------------------

  // set up 1st idle Callback
  ESP32_I2C_Master_Definition->common.Common_CtrlRegA |= F_WANTS_IDLE_TASK;

  return retMsg;

// XXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXXX

// alternative end in case of errors - free/destroy all allocated things and return SCDE_FAIL.
/* err:

  if (parsedKVInput) {

    free(parsedKVInput);

  }

  if (p_i2c->rx_ring_buf) {

    vRingbufferDelete(p_i2c->rx_ring_buf);
    p_i2c->rx_ring_buf = NULL;
    p_i2c->rx_buf_length = 0;

  }

  if (p_i2c->tx_ring_buf) {

    vRingbufferDelete(p_i2c->tx_ring_buf);
    p_i2c->tx_ring_buf = NULL;
    p_i2c->tx_buf_length = 0;

  }

  if (p_i2c->cmd_sem) {

    vSemaphoreDelete(p_i2c->cmd_sem);

  }

  if (p_i2c->cmd_mux) {

    vSemaphoreDelete(p_i2c->cmd_mux);

  }

  if (p_i2c->slv_rx_mux) {

    vSemaphoreDelete(p_i2c->slv_rx_mux);

  }

  if (p_i2c->slv_tx_mux) {

    vSemaphoreDelete(p_i2c->slv_tx_mux);
  }
*/
  return retMsg;

}



/**
 * --------------------------------------------------------------------------------------------------
 *  FName: ESP32_I2C_Master_DirectWrite
 *  Desc: for 2 stage designs - called to give write job to 1st stage (this stage)
 *  Info: 
 *  Para: ESP32_I2C_Master_Definition_t *ESP32_I2C_Master_Definition -> WebIF Definition that should be removed
 *  Rets: strTextMultiple_t* -> response text NULL=no text
 * --------------------------------------------------------------------------------------------------
 */
/*
strTextMultiple_t *
ESP32_I2C_Master_DirectWrite(
	 Common_Definition_t *Common_Definition_Stage1
	,Common_Definition_t *Common_Definition_Stage2
	,Common_StageXCHG_t *Common_StageXCHG)
{
  // for Fn response msg
  strTextMultiple_t *retMsg = NULL;
  // to adress 1st stage definition - make common ptr to modul specific ptr
  ESP32_I2C_Master_Definition_t *ESP32_I2C_Master_Definition_Stage1 =
	(ESP32_I2C_Master_Definition_t*) Common_Definition_Stage1;
  // make common ptr to modul specific ptr
  ESP32_I2C_Master_StageXCHG_t *ESP32_I2C_Master_StageXCHG =
	(ESP32_I2C_Master_StageXCHG_t*) Common_StageXCHG;
// -------------------------------------------------------------------------------------------------
// check 4 matching modules
// -------------------------------------------------------------------------------------------------
// -------------------------------------------------------------------------------------------------
  #if ESP32_I2C_Master_Module_DBG >= 5
  SCDEFn->Log3Fn(
	 ESP32_I2C_Master_Definition_Stage1->common.name
	,ESP32_I2C_Master_Definition_Stage1->common.nameLen
	,5
	,"DirectWriteFn of Definition '%.*s' (Module '%.*s') is called "
  	 "from Definition '%.*s' (Module '%.*s') to exec write job."
	,ESP32_I2C_Master_Definition_Stage1->common.nameLen
	,ESP32_I2C_Master_Definition_Stage1->common.name
	,ESP32_I2C_Master_Definition_Stage1->common.module->ProvidedByModule->typeNameLen
	,ESP32_I2C_Master_Definition_Stage1->common.module->ProvidedByModule->typeName
	,Common_Definition_Stage2->nameLen
	,Common_Definition_Stage2->name
	,Common_Definition_Stage2->module->ProvidedByModule->typeNameLen
	,Common_Definition_Stage2->module->ProvidedByModule->typeName);
  #endif
// -------------------------------------------------------------------------------------------------
  return retMsg;
}
*/


