mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
//>Add Readings Bit 05 -----------------------------------------------------------------------------
/*
  // add reading 'Alltime_Total_Factor' //atf'
  if (affectedReadings & ESP32_I2C_Master_R_ATF) {
	readingNameTextLen = asprintf((char **) &readingNameText
		,"Alltime_Total_Factor");
	readingValueTextLen = asprintf((char **) &readingValueText
		,"%d.%04d"
		,(int) (ESP32_I2C_Master_Definition->IB01_AlltimeTotalFactor)	
		,(int) ( (ESP32_I2C_Master_Definition->IB01_AlltimeTotalFactor -
		(int) ESP32_I2C_Master_Definition->IB01_AlltimeTotalFactor) * 10000) );
	SCDEFn->readingsBulkUpdateFn((Common_Definition_t*) ESP32_I2C_Master_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);
  }
*/
//	RespArgsWPos += os_sprintf(RespArgsWPos
//		,"&atf=%d.%04d"
//		,(int)(SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalFactor)	
//		,(int)((SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalFactor -
//		(int)SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalFactor)*10000) );


//>Add Readings Bit 06 -----------------------------------------------------------------------------
/*
  // add reading 'Alltime_Total_Unit' //atu'
  if (affectedReadings & ESP32_I2C_Master_R_ATU) {
	readingNameTextLen = asprintf((char **) &readingNameText
		,"Alltime_Total_Unit");
	readingValueTextLen = asprintf((char **) &readingValueText
		,"%s"
		,ESP32_I2C_Master_Definition->IB01_AlltimeTotalUnit);
	SCDEFn->readingsBulkUpdateFn((Common_Definition_t*) ESP32_I2C_Master_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);
  }
*/
//	RespArgsWPos += os_sprintf(RespArgsWPos
//		,"&atu=%s"
//		,SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_AlltimeTotalUnit);


//>Add Readings Bit 07 -----------------------------------------------------------------------------
/*
  // add reading 'Debounce' //deb'
  if (affectedReadings & ESP32_I2C_Master_R_DEB) {
	readingNameTextLen = asprintf((char **) &readingNameText
		,"Debounce");
	readingValueTextLen = asprintf((char **) &readingValueText
		,"%u"
		,ESP32_I2C_Master_Definition->IB01_Debounce);
	SCDEFn->readingsBulkUpdateFn((Common_Definition_t*) ESP32_I2C_Master_Definition
		,readingNameText
		,readingNameTextLen
		,readingValueText
		,readingValueTextLen);
  }
*/
//	RespArgsWPos += os_sprintf(RespArgsWPos
//		,"&deb=%u"
//		,SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_Debounce);


//>Add Readings Bit 08 -----------------------------------------------------------------------------
/*
  if (affectedReadings & ESP32_I2C_Master_R_name)
	{
	// add Unique-Feature-ID for identification purposes (Name-Change, ...)
	RespArgsWPos += S0_UFID(RespArgsWPos, ADID);
	// add capabilities of this feature ...
	RespArgsWPos += os_sprintf(RespArgsWPos,
		"&caps=0007");						// 0b11110 <-16BIT-HEX
	// add current name of this feature
	RespArgsWPos += os_sprintf(RespArgsWPos,
		"&name=%s",SysCfgRamFlashMirrored->MyS0_FeatCfgRamFlashMirrored[ADID].IB01_Name);
	}
*/

//>always add Reading - state ----------------------------------------------------------------------
/*
	// are we adding ?
	if (RespArgsWPos) RespArgsWPos += os_sprintf(RespArgsWPos,"&");
	// always add state ! on / off
	RespArgsWPos += os_sprintf(RespArgsWPos,
		"state=on");
*/
//--------------------------------------------------------------------------------------------------


  // all readings done, finnish update
//  SCDEFn->readingsEndUpdateFn((Common_Definition_t*) ESP32_I2C_Master_Definition);


  return true;
}








/*

    For i2c master mode, we don't need to use a buffer for the data, the APIs will execute the master commands
and return after all of the commands have been sent out or when error occurs. So when we send master commands,
we should free or modify the source data only after the i2c_master_cmd_begin function returns.
    For i2c slave mode, we need a data buffer to stash the sending and receiving data, because the hardware fifo
has only 32 bytes.
*/
esp_err_t 
i2c_driver_install( i2c_port_t i2c_num,
	i2c_obj_t** pp_i2c_obj,
	i2c_mode_t mode,
	size_t slv_rx_buf_len,
	size_t slv_tx_buf_len,
	int intr_alloc_flags)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(mode == I2C_MODE_MASTER || ( slv_rx_buf_len > 100 || slv_tx_buf_len > 100 ),
	I2C_SLAVE_BUFFER_LEN_ERR_STR, ESP_ERR_INVALID_ARG);

  uint32_t intr_mask = 0;

  // i2c driver not initialized ?
  if (*pp_i2c_obj == NULL) {

	#if !CONFIG_SPIRAM_USE_MALLOC
        *pp_i2c_obj = (i2c_obj_t*) calloc(1, sizeof(i2c_obj_t));

	#else

	if( !(intr_alloc_flags & ESP_INTR_FLAG_IRAM) ) {

 		 *pp_i2c_obj = (i2c_obj_t*) calloc(1, sizeof(i2c_obj_t));

        } else {

		*pp_i2c_obj = (i2c_obj_t*) heap_caps_calloc(1,
			sizeof(i2c_obj_t), MALLOC_CAP_INTERNAL|MALLOC_CAP_8BIT);
        }
	#endif

        if ( *pp_i2c_obj == NULL ) {
 
		ESP_LOGE(I2C_TAG, I2C_DRIVER_MALLOC_ERR_STR);

		return ESP_FAIL;
	}

	// get the ptr to the allocated i2c obj
	i2c_obj_t* p_i2c = *pp_i2c_obj;

        p_i2c->i2c_num = i2c_num;
        p_i2c->mode = mode;
        p_i2c->cmd_idx = 0;
        p_i2c->rx_cnt = 0;
        p_i2c->status = I2C_STATUS_IDLE;

	#if CONFIG_SPIRAM_USE_MALLOC
        p_i2c->intr_alloc_flags = intr_alloc_flags;
	#endif

        p_i2c->rx_fifo_remain = I2C_FIFO_LEN;
        p_i2c->tx_fifo_remain = I2C_FIFO_LEN;

        if (mode == I2C_MODE_SLAVE) {

		//we only use ringbuffer for slave mode.
		if (slv_rx_buf_len > 0) {

                	p_i2c->rx_ring_buf = 
				xRingbufferCreate(slv_rx_buf_len, RINGBUF_TYPE_BYTEBUF);

			if (p_i2c->rx_ring_buf == NULL) {

				ESP_LOGE(I2C_TAG, I2C_BUF_ERR_STR);

				goto err;
			}

			p_i2c->rx_buf_length = slv_rx_buf_len;

		} else {

			p_i2c->rx_ring_buf = NULL;
			p_i2c->rx_buf_length = 0;
		}

		if (slv_tx_buf_len > 0) {

			p_i2c->tx_ring_buf =
				xRingbufferCreate(slv_tx_buf_len, RINGBUF_TYPE_BYTEBUF);

			if (p_i2c->tx_ring_buf == NULL) {

				ESP_LOGE(I2C_TAG, I2C_BUF_ERR_STR);

