mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
				goto err;
			}

			p_i2c->tx_buf_length = slv_tx_buf_len;

		} else {

			p_i2c->tx_ring_buf = NULL;

			p_i2c->tx_buf_length = 0;

		}

 		p_i2c->slv_rx_mux = xSemaphoreCreateMutex();

		p_i2c->slv_tx_mux = xSemaphoreCreateMutex();

		if (p_i2c->slv_rx_mux == NULL || p_i2c->slv_tx_mux == NULL) {

			ESP_LOGE(I2C_TAG, I2C_SEM_ERR_STR);

			goto err;
		}

		intr_mask |= ( I2C_RXFIFO_FULL_INT_ENA_M | I2C_TRANS_COMPLETE_INT_ENA_M);

	} else {

		// semaphore to sync sending process, because we only have 32 bytes for hardware fifo.
		p_i2c->cmd_mux = xSemaphoreCreateMutex();

		#if !CONFIG_SPIRAM_USE_MALLOC
		p_i2c->cmd_evt_queue = 
			xQueueCreate(I2C_EVT_QUEUE_LEN, sizeof(i2c_cmd_evt_t));

		#else
		if( !(intr_alloc_flags & ESP_INTR_FLAG_IRAM) ) {

			p_i2c->cmd_evt_queue = xQueueCreate(I2C_EVT_QUEUE_LEN, sizeof(i2c_cmd_evt_t));

		} else {

			_i2c->evt_queue_storage = 
				(uint8_t *)heap_caps_calloc(I2C_EVT_QUEUE_LEN,
				sizeof(i2c_cmd_evt_t),
				MALLOC_CAP_INTERNAL|MALLOC_CAP_8BIT);

			if( p_i2c->evt_queue_storage == NULL ) {

				ESP_LOGE(I2C_TAG, I2C_DRIVER_MALLOC_ERR_STR);

				goto err;
  			}

			memset(&p_i2c->evt_queue_buffer, 0, sizeof(StaticQueue_t));

			p_i2c->cmd_evt_queue =  
				xQueueCreateStatic(I2C_EVT_QUEUE_LEN,
					sizeof(i2c_cmd_evt_t),
					p_i2c->evt_queue_storage,
					&p_i2c->evt_queue_buffer);
		}
		#endif

		if (p_i2c->cmd_mux == NULL || p_i2c->cmd_evt_queue == NULL) {

			ESP_LOGE(I2C_TAG, I2C_SEM_ERR_STR);

			goto err;
		}

		// command link
		p_i2c->cmd_link.cur = NULL;
		p_i2c->cmd_link.head = NULL;
		p_i2c->cmd_link.free = NULL;

		p_i2c->tx_ring_buf = NULL;
		p_i2c->rx_buf_length = 0;
		p_i2c->tx_ring_buf = NULL;
		p_i2c->tx_buf_length = 0;

		intr_mask |= I2C_ARBITRATION_LOST_INT_ENA_M | I2C_TIME_OUT_INT_ST_M;

	}

  // i2c driver already initialized !
  } else {

	ESP_LOGE(I2C_TAG, I2C_DRIVER_ERR_STR);

	return ESP_FAIL;
  }

  i2c_obj_t* p_i2c = *pp_i2c_obj;

  // hook isr handler
  i2c_isr_register(i2c_num,
	i2c_isr_handler_default,
	*pp_i2c_obj,
	intr_alloc_flags,
	&p_i2c->intr_handle);

  intr_mask |= ( I2C_TRANS_COMPLETE_INT_ENA_M |
		 I2C_TRANS_START_INT_ENA_M |
		 I2C_ACK_ERR_INT_ENA_M |
		 I2C_RXFIFO_OVF_INT_ENA_M |
		 I2C_SLAVE_TRAN_COMP_INT_ENA_M);

  I2C[i2c_num]->int_clr.val = intr_mask;

  I2C[i2c_num]->int_ena.val = intr_mask;

  return ESP_OK;


  err:

  // Some error has happened. Free/destroy all allocated things and return ESP_FAIL.
  if (*pp_i2c_obj) {

	// get the ptr to the allocated i2c obj
	i2c_obj_t* p_i2c = *pp_i2c_obj;

	if (p_i2c->rx_ring_buf) {

		vRingbufferDelete(p_i2c->rx_ring_buf);

		p_i2c->rx_ring_buf = NULL;

		p_i2c->rx_buf_length = 0;
	}

	if (p_i2c->tx_ring_buf) {

		vRingbufferDelete(p_i2c->tx_ring_buf);

		p_i2c->tx_ring_buf = NULL;

		p_i2c->tx_buf_length = 0;
	}

	if (p_i2c->cmd_evt_queue) {

		vQueueDelete(p_i2c->cmd_evt_queue);

		p_i2c->cmd_evt_queue = NULL;
	}

	if (p_i2c->cmd_mux) {

		vSemaphoreDelete(p_i2c->cmd_mux);
	}

	if (p_i2c->slv_rx_mux) {

		vSemaphoreDelete(p_i2c->slv_rx_mux);
	}

	if (p_i2c->slv_tx_mux) {

		vSemaphoreDelete(p_i2c->slv_tx_mux);
	}

	#if CONFIG_SPIRAM_USE_MALLOC
	if (p_i2c->evt_queue_storage) {

		free(p_i2c->evt_queue_storage);

 		p_i2c->evt_queue_storage = NULL;
	}
	#endif

  free(p_i2c);

  *pp_i2c_obj = NULL;

  }

  return ESP_FAIL;
}



static esp_err_t 
i2c_hw_enable(i2c_port_t i2c_num)
{
  if (i2c_num == I2C_NUM_0) {

	periph_module_enable(PERIPH_I2C0_MODULE);

  } else if (i2c_num == I2C_NUM_1) {

	periph_module_enable(PERIPH_I2C1_MODULE);
  }

  return ESP_OK;
}



static esp_err_t 
i2c_hw_disable(i2c_port_t i2c_num)
{
  if (i2c_num == I2C_NUM_0) {

	periph_module_disable(PERIPH_I2C0_MODULE);

  } else if (i2c_num == I2C_NUM_1) {

	periph_module_disable(PERIPH_I2C1_MODULE);
  }

  return ESP_OK;
}



esp_err_t 
i2c_driver_delete(i2c_obj_t** p_i2c_obj)
{
  // get the pointer to the i2c object
  i2c_obj_t* p_i2c = *p_i2c_obj;	// i2c_obj_t ptr, named p_i2c = read data from prt p_i2c_obj

  i2c_port_t i2c_num = p_i2c->i2c_num;

  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(p_i2c != NULL, I2C_DRIVER_ERR_STR, ESP_FAIL);

  I2C[i2c_num]->int_ena.val = 0;

  esp_intr_free(p_i2c->intr_handle);

  p_i2c->intr_handle = NULL;

  if (p_i2c->cmd_mux) {

	xSemaphoreTake(p_i2c->cmd_mux, portMAX_DELAY);

	vSemaphoreDelete(p_i2c->cmd_mux);
  }

  if (p_i2c->cmd_evt_queue) {

	vQueueDelete(p_i2c->cmd_evt_queue);

	p_i2c->cmd_evt_queue = NULL;
  }

  if (p_i2c->slv_rx_mux) {

	vSemaphoreDelete(p_i2c->slv_rx_mux);
  }

  if (p_i2c->slv_tx_mux) {

	vSemaphoreDelete(p_i2c->slv_tx_mux);
  }

  if (p_i2c->rx_ring_buf) {

	vRingbufferDelete(p_i2c->rx_ring_buf);

	p_i2c->rx_ring_buf = NULL;

	p_i2c->rx_buf_length = 0;
  }

  if (p_i2c->tx_ring_buf) {

	vRingbufferDelete(p_i2c->tx_ring_buf);

	p_i2c->tx_ring_buf = NULL;

	p_i2c->tx_buf_length = 0;
  }

  #if CONFIG_SPIRAM_USE_MALLOC
  if (p_i2c->evt_queue_storage) {

	free(p_i2c->evt_queue_storage);

	p_i2c->evt_queue_storage = NULL;
  }
  #endif

  // finally free the i2c object
  free(p_i2c);
  *p_i2c_obj = NULL;

  i2c_hw_disable(i2c_num);

  return ESP_OK;
}






/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_reset_tx_fifo
 *  Desc: Resets the hardware tx fifo
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_reset_tx_fifo(i2c_port_t i2c_num)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->fifo_conf.tx_fifo_rst = 1;

  I2C[i2c_num]->fifo_conf.tx_fifo_rst = 0;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_reset_rx_fifo
 *  Desc: Resets the hardware rx fifo 
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_reset_rx_fifo(i2c_port_t i2c_num)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

