mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
  I2C[i2c_num]->fifo_conf.rx_fifo_rst = 1;

  I2C[i2c_num]->fifo_conf.rx_fifo_rst = 0;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



static void IRAM_ATTR
i2c_isr_handler_default(void* arg)
{
/*  // we got ptr to ESP32_I2C_Master_Definition_t
  ESP32_I2C_Master_Definition_t* ESP32_I2C_Master_Definition =
		  (ESP32_I2C_Master_Definition_t*) arg;
  // create ptr to i2c_obj_t
  i2c_obj_t* p_i2c = &ESP32_I2C_Master_Definition->i2c_obj;
*/

  i2c_obj_t* p_i2c = (i2c_obj_t*) arg;

  int i2c_num = p_i2c->i2c_num;

  uint32_t status = I2C[i2c_num]->int_status.val;

  int idx = 0;

  portBASE_TYPE HPTaskAwoken = pdFALSE;

  while (status != 0) {

    status = I2C[i2c_num]->int_status.val;

    if (status & I2C_TX_SEND_EMPTY_INT_ST_M) {

      I2C[i2c_num]->int_clr.tx_send_empty = 1;

    } else if (status & I2C_RX_REC_FULL_INT_ST_M) {

      I2C[i2c_num]->int_clr.rx_rec_full = 1;

    } else if (status & I2C_ACK_ERR_INT_ST_M) {

      I2C[i2c_num]->int_clr.ack_err = 1;

      if (p_i2c->mode == I2C_MODE_MASTER) {

        p_i2c->status = I2C_STATUS_ACK_ERROR;

        I2C[i2c_num]->int_clr.ack_err = 1;

        //get error ack value from slave device, stop the commands
        i2c_master_cmd_begin_static(p_i2c);
      }

    } else if (status & I2C_TRANS_START_INT_ST_M) {

      I2C[i2c_num]->int_clr.trans_start = 1;

    } else if (status & I2C_TIME_OUT_INT_ST_M) {

      I2C[i2c_num]->int_clr.time_out = 1;

    } else if (status & I2C_TRANS_COMPLETE_INT_ST_M) {

      I2C[i2c_num]->int_clr.trans_complete = 1;

      if (p_i2c->mode == I2C_MODE_SLAVE) {

        int rx_fifo_cnt = I2C[i2c_num]->status_reg.rx_fifo_cnt;

        for (idx = 0; idx < rx_fifo_cnt; idx++) {

          p_i2c->data_buf[idx] = I2C[i2c_num]->fifo_data.data;
        }

        xRingbufferSendFromISR(p_i2c->rx_ring_buf
          ,p_i2c->data_buf
          ,rx_fifo_cnt
          ,&HPTaskAwoken);

        if (HPTaskAwoken == pdTRUE) {

          portYIELD_FROM_ISR();
        }

        I2C[i2c_num]->int_clr.rx_fifo_full = 1;

      } else {

        if (p_i2c->status != I2C_STATUS_ACK_ERROR) {

          i2c_master_cmd_begin_static(p_i2c);
        }
      }

    } else if (status & I2C_MASTER_TRAN_COMP_INT_ST_M) {

      I2C[i2c_num]->int_clr.master_tran_comp = 1;

    } else if (status & I2C_ARBITRATION_LOST_INT_ST_M) {

      I2C[i2c_num]->int_clr.arbitration_lost = 1;

    } else if (status & I2C_SLAVE_TRAN_COMP_INT_ST_M) {

      I2C[i2c_num]->int_clr.slave_tran_comp = 1;

    } else if (status & I2C_END_DETECT_INT_ST_M) {

      I2C[i2c_num]->int_ena.end_detect = 0;

      I2C[i2c_num]->int_clr.end_detect = 1;

      i2c_master_cmd_begin_static(p_i2c);

    } else if (status & I2C_RXFIFO_OVF_INT_ST_M) {

      I2C[i2c_num]->int_clr.rx_fifo_ovf = 1;

    } else if (status & I2C_TXFIFO_EMPTY_INT_ST_M) {

      int tx_fifo_rem = I2C_FIFO_LEN - 
        I2C[i2c_num]->status_reg.tx_fifo_cnt;

      size_t size = 0;

      uint8_t *data = (uint8_t*) xRingbufferReceiveUpToFromISR(p_i2c->tx_ring_buf
        ,&size
        ,tx_fifo_rem);

      if (data) {

        for (idx = 0; idx < size; idx++) {

          WRITE_PERI_REG(I2C_DATA_APB_REG(i2c_num), data[idx]);
        }

        vRingbufferReturnItemFromISR(p_i2c->tx_ring_buf, data, &HPTaskAwoken);

          if (HPTaskAwoken == pdTRUE) {
            portYIELD_FROM_ISR();
          }

        I2C[i2c_num]->int_ena.tx_fifo_empty = 1;

        I2C[i2c_num]->int_clr.tx_fifo_empty = 1;

        } else {

      I2C[i2c_num]->int_ena.tx_fifo_empty = 0;

      I2C[i2c_num]->int_clr.tx_fifo_empty = 1;
    }

  } else if (status & I2C_RXFIFO_FULL_INT_ST_M) {

    int rx_fifo_cnt = I2C[i2c_num]->status_reg.rx_fifo_cnt;

    for (idx = 0; idx < rx_fifo_cnt; idx++) {

      p_i2c->data_buf[idx] = I2C[i2c_num]->fifo_data.data;
    }

    xRingbufferSendFromISR(p_i2c->rx_ring_buf, p_i2c->data_buf, rx_fifo_cnt, &HPTaskAwoken);

    if (HPTaskAwoken == pdTRUE) {

      portYIELD_FROM_ISR();
    }

    I2C[i2c_num]->int_clr.rx_fifo_full = 1;

    } else {

      I2C[i2c_num]->int_clr.val = status;
    }
  }
}



esp_err_t 
i2c_set_data_mode(i2c_port_t i2c_num, i2c_trans_mode_t tx_trans_mode, i2c_trans_mode_t rx_trans_mode)

{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(tx_trans_mode < I2C_DATA_MODE_MAX, I2C_TRANS_MODE_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(rx_trans_mode < I2C_DATA_MODE_MAX, I2C_TRANS_MODE_ERR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->ctr.rx_lsb_first = rx_trans_mode; //set rx data msb first

  I2C[i2c_num]->ctr.tx_lsb_first = tx_trans_mode; //set tx data msb first

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t
i2c_get_data_mode(i2c_port_t i2c_num, i2c_trans_mode_t *tx_trans_mode, i2c_trans_mode_t *rx_trans_mode)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  if (tx_trans_mode) {

        *tx_trans_mode = I2C[i2c_num]->ctr.tx_lsb_first;
  }

  if (rx_trans_mode) {

        *rx_trans_mode = I2C[i2c_num]->ctr.rx_lsb_first;
  }

  return ESP_OK;
}



/* Some slave device will die by accident and keep the SDA in low level,
 * in this case, master should send several clock to make the slave release the bus.
 * Slave mode of ESP32 might also get in wrong state that held the SDA low,
 * in this case, master device could send a stop signal to make esp32 slave release the bus.
 **/
static esp_err_t 
i2c_master_clear_bus(i2c_port_t i2c_num)

{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  const int scl_half_period = I2C_CLR_BUS_HALF_PERIOD_US; // use standard 100kHz data rate

  int sda_in_sig = 0, scl_in_sig = 0;

  int i = 0;

  if (i2c_num == I2C_NUM_0) {

	sda_in_sig = I2CEXT0_SDA_IN_IDX;

	scl_in_sig = I2CEXT0_SCL_IN_IDX;

