mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
  } else if (i2c_num == I2C_NUM_1) {

	sda_in_sig = I2CEXT1_SDA_IN_IDX;

	scl_in_sig = I2CEXT1_SCL_IN_IDX;

  }

  int scl_io = GPIO.func_in_sel_cfg[scl_in_sig].func_sel;

  int sda_io = GPIO.func_in_sel_cfg[sda_in_sig].func_sel;

  I2C_CHECK((GPIO_IS_VALID_OUTPUT_GPIO(scl_io)), I2C_SCL_IO_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((GPIO_IS_VALID_OUTPUT_GPIO(sda_io)), I2C_SDA_IO_ERR_STR, ESP_ERR_INVALID_ARG);

  gpio_set_direction(scl_io, GPIO_MODE_OUTPUT_OD);

  gpio_set_direction(sda_io, GPIO_MODE_INPUT_OUTPUT_OD);

  // If a SLAVE device was in a read operation when the bus was interrupted, the SLAVE device is controlling SDA.
  // The only bit during the 9 clock cycles of a READ byte the MASTER(ESP32) is guaranteed control over is during the ACK bit
  // period. If the slave is sending a stream of ZERO bytes, it will only release SDA during the ACK bit period.
  // So, this reset code needs to synchronize the bit stream with, Either, the ACK bit, Or a 1 bit to correctly generate

  // a STOP condition.
  gpio_set_level(scl_io, 0);

  gpio_set_level(sda_io, 1);

  ets_delay_us(scl_half_period);

  while(!gpio_get_level(sda_io) && (i++ < I2C_CLR_BUS_SCL_NUM)) {

	gpio_set_level(scl_io, 1);

	ets_delay_us(scl_half_period);

	gpio_set_level(scl_io, 0);

	ets_delay_us(scl_half_period);
  }

  gpio_set_level(sda_io,0); // setup for STOP

  gpio_set_level(scl_io,1);

  ets_delay_us(scl_half_period);

  gpio_set_level(sda_io, 1); // STOP, SDA low -> high while SCL is HIGH

  i2c_set_pin(i2c_num, sda_io, scl_io, 1, 1, I2C_MODE_MASTER);

  return ESP_OK;
}



/**if the power and SDA/SCL wires are in proper condition, everything works find with reading the slave.
 * If we remove the power supply for the slave during I2C is reading, or directly connect SDA or SCL to ground,
 * this would cause the I2C FSM get stuck in wrong state, all we can do is to reset the I2C hardware in this case.
 **/
static esp_err_t 
i2c_hw_fsm_reset(i2c_port_t i2c_num)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  uint32_t ctr              = I2C[i2c_num]->ctr.val;
  uint32_t fifo_conf        = I2C[i2c_num]->fifo_conf.val;
  uint32_t scl_low_period   = I2C[i2c_num]->scl_low_period.val;
  uint32_t scl_high_period  = I2C[i2c_num]->scl_high_period.val;
  uint32_t scl_start_hold   = I2C[i2c_num]->scl_start_hold.val;
  uint32_t scl_rstart_setup = I2C[i2c_num]->scl_rstart_setup.val;
  uint32_t scl_stop_hold    = I2C[i2c_num]->scl_stop_hold.val;
  uint32_t scl_stop_setup   = I2C[i2c_num]->scl_stop_setup.val;
  uint32_t sda_hold         = I2C[i2c_num]->sda_hold.val;
  uint32_t sda_sample       = I2C[i2c_num]->sda_sample.val;
  uint32_t timeout          = I2C[i2c_num]->timeout.val;
  uint32_t scl_filter_cfg   = I2C[i2c_num]->scl_filter_cfg.val;
  uint32_t sda_filter_cfg   = I2C[i2c_num]->sda_filter_cfg.val;
  uint32_t slave_addr       = I2C[i2c_num]->slave_addr.val;



  // to reset the I2C hw module, we need re-enable the hw

  i2c_hw_disable(i2c_num);
  i2c_master_clear_bus(i2c_num);
  i2c_hw_enable(i2c_num);

  I2C[i2c_num]->int_ena.val          = 0;
  I2C[i2c_num]->ctr.val              = ctr & (~I2C_TRANS_START_M);
  I2C[i2c_num]->fifo_conf.val        = fifo_conf;
  I2C[i2c_num]->scl_low_period.val   = scl_low_period;
  I2C[i2c_num]->scl_high_period.val  = scl_high_period;
  I2C[i2c_num]->scl_start_hold.val   = scl_start_hold;
  I2C[i2c_num]->scl_rstart_setup.val = scl_rstart_setup;
  I2C[i2c_num]->scl_stop_hold.val    = scl_stop_hold;
  I2C[i2c_num]->scl_stop_setup.val   = scl_stop_setup;
  I2C[i2c_num]->sda_hold.val         = sda_hold;
  I2C[i2c_num]->sda_sample.val       = sda_sample;
  I2C[i2c_num]->timeout.val          = timeout;
  I2C[i2c_num]->scl_filter_cfg.val   = scl_filter_cfg;
  I2C[i2c_num]->sda_filter_cfg.val   = sda_filter_cfg;

  uint32_t intr_mask = ( I2C_TRANS_COMPLETE_INT_ENA_M
                       | I2C_TRANS_START_INT_ENA_M
                       | I2C_ACK_ERR_INT_ENA_M
                       | I2C_RXFIFO_OVF_INT_ENA_M
                       | I2C_SLAVE_TRAN_COMP_INT_ENA_M
                       | I2C_TIME_OUT_INT_ENA_M);

  if (I2C[i2c_num]->ctr.ms_mode == I2C_MODE_SLAVE) {

	I2C[i2c_num]->slave_addr.val = slave_addr;

	intr_mask |= ( I2C_RXFIFO_FULL_INT_ENA_M | I2C_TRANS_COMPLETE_INT_ENA_M);

  } else {

	intr_mask |= I2C_ARBITRATION_LOST_INT_ENA_M;
  }

  I2C[i2c_num]->int_clr.val = intr_mask;

  I2C[i2c_num]->int_ena.val = intr_mask;

  return ESP_OK;
}








/** syncd
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_param_config
 *  Desc: Configures the i2c Hardware,
 *  Info: 
 *  Para: i2c_port_t i2c_num -> the number of i2c-HW to use
 *  const i2c_config_t *i2c_conf -> ptr to filled cfg-data
 *  Rets: strTextMultiple_t* -> SCDE_OK, or error txts - for log
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
i2c_param_config(i2c_port_t i2c_num
	,const i2c_config_t *i2c_conf)
{
  // start without error
  strTextMultiple_t* retMsg = SCDE_OK;

  SCDE_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR);
  SCDE_CHECK(i2c_conf != NULL, I2C_ADDR_ERROR_STR);
  SCDE_CHECK(i2c_conf->mode < I2C_MODE_MAX, I2C_MODE_ERR_STR);

  // config the GPIO-pin,
  retMsg = i2c_set_pin(i2c_num, i2c_conf->sda_io_num, i2c_conf->scl_io_num,
			i2c_conf->sda_pullup_en, i2c_conf->scl_pullup_en, i2c_conf->mode);
  // error during config ? return with MSG
  if (retMsg != SCDE_OK) {

	return retMsg;
  }

  // Reset+enable the I2C hardware in case there is a soft reboot.
  i2c_hw_disable(i2c_num);
  i2c_hw_enable(i2c_num);

  // ??
  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  // set rx data msb first
  I2C[i2c_num]->ctr.rx_lsb_first = I2C_DATA_MODE_MSB_FIRST;

  // set tx data msb first
  I2C[i2c_num]->ctr.tx_lsb_first = I2C_DATA_MODE_MSB_FIRST;

