mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
  // mode for master or slave
  I2C[i2c_num]->ctr.ms_mode = i2c_conf->mode;

  // set open-drain output mode
  I2C[i2c_num]->ctr.sda_force_out = 1;

  // set open-drain output mode
  I2C[i2c_num]->ctr.scl_force_out = 1;

  // sample at high level of clock
  I2C[i2c_num]->ctr.sample_scl_level = 0;

  // slave mode ?
  if (i2c_conf->mode == I2C_MODE_SLAVE) {

	I2C[i2c_num]->slave_addr.addr = i2c_conf->slave.slave_addr;
	I2C[i2c_num]->slave_addr.en_10bit = i2c_conf->slave.addr_10bit_en;
	I2C[i2c_num]->fifo_conf.nonfifo_en = 0;
	I2C[i2c_num]->fifo_conf.fifo_addr_cfg_en = 0;
	I2C[i2c_num]->fifo_conf.rx_fifo_full_thrhd = I2C_FIFO_FULL_THRESH_VAL;
	I2C[i2c_num]->fifo_conf.tx_fifo_empty_thrhd = I2C_FIFO_EMPTY_THRESH_VAL;
	I2C[i2c_num]->int_ena.rx_fifo_full = 1;
	I2C[i2c_num]->ctr.trans_start = 0;
	I2C[i2c_num]->timeout.tout = I2C_SLAVE_TIMEOUT_DEFAULT;

	//set timing for data
	I2C[i2c_num]->sda_hold.time = I2C_SLAVE_SDA_HOLD_DEFAULT;
	I2C[i2c_num]->sda_sample.time = I2C_SLAVE_SDA_SAMPLE_DEFAULT;
  }

  // master mode ?
  else {

	I2C[i2c_num]->fifo_conf.nonfifo_en = 0;

	int cycle = (I2C_APB_CLK_FREQ / i2c_conf->master.clk_speed);

	int half_cycle = cycle / 2;

	I2C[i2c_num]->timeout.tout = cycle * I2C_MASTER_TOUT_CNUM_DEFAULT;

	//set timing for data
	I2C[i2c_num]->sda_hold.time = half_cycle / 2;
	I2C[i2c_num]->sda_sample.time = half_cycle / 2;

	I2C[i2c_num]->scl_low_period.period = half_cycle;
	I2C[i2c_num]->scl_high_period.period = half_cycle;

	//set timing for start signal
	I2C[i2c_num]->scl_start_hold.time = half_cycle;
	I2C[i2c_num]->scl_rstart_setup.time = half_cycle;

	//set timing for stop signal
	I2C[i2c_num]->scl_stop_hold.time = half_cycle;
	I2C[i2c_num]->scl_stop_setup.time = half_cycle;

	//Default, we enable hardware filter

	i2c_filter_enable(i2c_num, I2C_FILTER_CYC_NUM_DEF);
  }

  // ???
  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return retMsg;
}



esp_err_t 
i2c_set_period(i2c_port_t i2c_num, int high_period, int low_period)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((high_period <= I2C_SCL_HIGH_PERIOD_V) && (high_period > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((low_period <= I2C_SCL_LOW_PERIOD_V) && (low_period > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->scl_high_period.period = high_period;

  I2C[i2c_num]->scl_low_period.period = low_period;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_get_period(i2c_port_t i2c_num, int* high_period, int* low_period)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  if (high_period) {

	*high_period = I2C[i2c_num]->scl_high_period.period;
  }

  if (low_period) {

	*low_period = I2C[i2c_num]->scl_low_period.period;
  }

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_filter_enable(i2c_port_t i2c_num, uint8_t cyc_num)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->scl_filter_cfg.thres = cyc_num;

  I2C[i2c_num]->sda_filter_cfg.thres = cyc_num;

  I2C[i2c_num]->scl_filter_cfg.en = 1;

  I2C[i2c_num]->sda_filter_cfg.en = 1;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_filter_disable(i2c_port_t i2c_num)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->scl_filter_cfg.en = 0;

  I2C[i2c_num]->sda_filter_cfg.en = 0;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_set_start_timing(i2c_port_t i2c_num, int setup_time, int hold_time)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((hold_time <= I2C_SCL_START_HOLD_TIME_V) && (hold_time > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((setup_time <= I2C_SCL_RSTART_SETUP_TIME_V) && (setup_time > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->scl_start_hold.time = hold_time;

  I2C[i2c_num]->scl_rstart_setup.time = setup_time;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_get_start_timing(i2c_port_t i2c_num, int* setup_time, int* hold_time)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  if (hold_time) {

	*hold_time = I2C[i2c_num]->scl_start_hold.time;
  }

  if (setup_time) {

	*setup_time = I2C[i2c_num]->scl_rstart_setup.time;
  }

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_set_stop_timing(i2c_port_t i2c_num, int setup_time, int hold_time)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((setup_time <= I2C_SCL_STOP_SETUP_TIME_V) && (setup_time > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((hold_time <= I2C_SCL_STOP_HOLD_TIME_V) && (hold_time > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->scl_stop_hold.time = hold_time;

  I2C[i2c_num]->scl_stop_setup.time = setup_time;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_get_stop_timing(i2c_port_t i2c_num, int* setup_time, int* hold_time)

{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  if (setup_time) {

	*setup_time = I2C[i2c_num]->scl_stop_setup.time;
  }

  if (hold_time) {

        *hold_time = I2C[i2c_num]->scl_stop_hold.time;
  }

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_set_data_timing(i2c_port_t i2c_num, int sample_time, int hold_time)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((sample_time <= I2C_SDA_SAMPLE_TIME_V) && (sample_time > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((hold_time <= I2C_SDA_HOLD_TIME_V) && (hold_time > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  I2C[i2c_num]->sda_hold.time = hold_time;

  I2C[i2c_num]->sda_sample.time = sample_time;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_get_data_timing(i2c_port_t i2c_num, int* sample_time, int* hold_time)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

  if (sample_time) {

	*sample_time = I2C[i2c_num]->sda_sample.time;
  }

  if (hold_time) {

	*hold_time = I2C[i2c_num]->sda_hold.time;
  }

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_set_timeout(i2c_port_t i2c_num, int timeout)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK((timeout <= I2C_TIME_OUT_REG_V) && (timeout > 0), I2C_TIMEING_VAL_ERR_STR, ESP_ERR_INVALID_ARG);

  I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

