mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
  I2C[i2c_num]->timeout.tout = timeout;

  I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

  return ESP_OK;
}



esp_err_t 
i2c_get_timeout(i2c_port_t i2c_num, int* timeout)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);

  if (timeout) {

	*timeout = I2C[i2c_num]->timeout.tout;

  }

  return ESP_OK;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_isr_register
 *  Desc: Registers the Interrupt for i2c  (2 available)
 *  Data: 
 *       i2c_port_t i2c_num
 *	 void (*fn)(void*)
 *	 void * arg
 *	 int intr_alloc_flags
 *	 intr_handle_t *handle -> the handle will be stored here
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_isr_register(i2c_port_t i2c_num
	,void (*fn)(void*)
	,void * arg
	,int intr_alloc_flags
	,intr_handle_t *handle)
{
  I2C_CHECK(i2c_num < I2C_NUM_MAX, I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(fn != NULL, I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);

  esp_err_t ret;

  switch (i2c_num) {

	case I2C_NUM_1:

		ret = esp_intr_alloc(ETS_I2C_EXT1_INTR_SOURCE, intr_alloc_flags, fn, arg, handle);

		break;

	case I2C_NUM_0:
	default:

		ret = esp_intr_alloc(ETS_I2C_EXT0_INTR_SOURCE, intr_alloc_flags, fn, arg, handle);

		break;
  }

  return ret;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  DName: i2c_isr_free
 *  Desc: Unregisters the Interrupt for i2c
 *  Data: 
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_isr_free(intr_handle_t handle)
{
  return esp_intr_free(handle);
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_set_pin
 *  Desc: Setup the i2c GPIO pin
 *  Info: 
 *  Para: i2c_obj_t *p_i2c -> ptr to the i2c processing object for this i2c num
 *        gpio_num_t sda_io_num -> 
 *        gpio_num_t scl_io_num -> 
 *        gpio_pullup_t sda_pullup_en -> 
 *        gpio_pullup_t scl_pullup_en -> 
 *        i2c_mode_t mode -> 
 *  Rets: strTextMultiple_t* -> SCDE_OK, or error txts - for log
 * -------------------------------------------------------------------------------------------------
 */
strTextMultiple_t*
i2c_set_pin(i2c_port_t i2c_num
			,gpio_num_t sda_io_num
			,gpio_num_t scl_io_num
			,gpio_pullup_t sda_pullup_en
			,gpio_pullup_t scl_pullup_en
			,i2c_mode_t mode)
{
  // start without error
  strTextMultiple_t* retMsg = SCDE_OK;

  SCDE_CHECK(( i2c_num < I2C_NUM_MAX ), I2C_NUM_ERROR_STR);
  SCDE_CHECK(((GPIO_IS_VALID_OUTPUT_GPIO(sda_io_num))), I2C_SDA_IO_ERR_STR);
  SCDE_CHECK((GPIO_IS_VALID_OUTPUT_GPIO(scl_io_num)) ||
              (GPIO_IS_VALID_GPIO(scl_io_num) && mode == I2C_MODE_SLAVE),
              I2C_SCL_IO_ERR_STR);
  SCDE_CHECK((sda_pullup_en == GPIO_PULLUP_ENABLE && GPIO_IS_VALID_OUTPUT_GPIO(sda_io_num)) ||
               sda_pullup_en == GPIO_PULLUP_DISABLE, I2C_GPIO_PULLUP_ERR_STR);
  SCDE_CHECK((scl_pullup_en == GPIO_PULLUP_ENABLE && GPIO_IS_VALID_OUTPUT_GPIO(scl_io_num)) ||
               scl_pullup_en == GPIO_PULLUP_DISABLE, I2C_GPIO_PULLUP_ERR_STR);

  int sda_in_sig, sda_out_sig, scl_in_sig, scl_out_sig;

  // prepare the i2c settings according to used hardware 
  switch (i2c_num) {

	case I2C_NUM_1:
		sda_out_sig = I2CEXT1_SDA_OUT_IDX;
		sda_in_sig = I2CEXT1_SDA_IN_IDX;
		scl_out_sig = I2CEXT1_SCL_OUT_IDX;
		scl_in_sig = I2CEXT1_SCL_IN_IDX;
		break;

	case I2C_NUM_0:
		default:
		sda_out_sig = I2CEXT0_SDA_OUT_IDX;
		sda_in_sig = I2CEXT0_SDA_IN_IDX;
		scl_out_sig = I2CEXT0_SCL_OUT_IDX;
		scl_in_sig = I2CEXT0_SCL_IN_IDX;
		break;
  }

  if (sda_io_num >= 0) {

	gpio_set_level(sda_io_num, I2C_IO_INIT_LEVEL);

	PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[sda_io_num], PIN_FUNC_GPIO);

	gpio_set_direction(sda_io_num, GPIO_MODE_INPUT_OUTPUT_OD);

	if (sda_pullup_en == GPIO_PULLUP_ENABLE) {

		gpio_set_pull_mode(sda_io_num, GPIO_PULLUP_ONLY);
        } 

	else {

		gpio_set_pull_mode(sda_io_num, GPIO_FLOATING);
        }

	gpio_matrix_out(sda_io_num, sda_out_sig, 0, 0);

	gpio_matrix_in(sda_io_num, sda_in_sig, 0);
  }

  if (scl_io_num >= 0) {

	gpio_set_level(scl_io_num, I2C_IO_INIT_LEVEL);

	PIN_FUNC_SELECT(GPIO_PIN_MUX_REG[scl_io_num], PIN_FUNC_GPIO);

	if (mode == I2C_MODE_MASTER) {

		gpio_set_direction(scl_io_num, GPIO_MODE_INPUT_OUTPUT_OD);

		gpio_matrix_out(scl_io_num, scl_out_sig, 0, 0);
	}

	else {

		gpio_set_direction(scl_io_num, GPIO_MODE_INPUT);
	}

	if (scl_pullup_en == GPIO_PULLUP_ENABLE) {

		gpio_set_pull_mode(scl_io_num, GPIO_PULLUP_ONLY);
	}

	else {

		gpio_set_pull_mode(scl_io_num, GPIO_FLOATING);
	}

	gpio_matrix_in(scl_io_num, scl_in_sig, 0);
  }

  return retMsg;
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_cmd_link_create
 *  Desc: Allocates a linked list head - without elements 
 *  Info: calloc -> zero filled
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *  Rets: i2c_cmd_desc_t* as void* i2c_cmd_handle_t
 * -------------------------------------------------------------------------------------------------
 */
i2c_cmd_handle_t
i2c_cmd_link_create()
{
  #if !CONFIG_SPIRAM_USE_MALLOC
  i2c_cmd_desc_t* cmd_desc = (i2c_cmd_desc_t*) calloc(1, sizeof(i2c_cmd_desc_t));
  #else
  i2c_cmd_desc_t* cmd_desc = (i2c_cmd_desc_t*) heap_caps_calloc(1, sizeof(i2c_cmd_desc_t), MALLOC_CAP_INTERNAL|MALLOC_CAP_8BIT);
  #endif

  return (i2c_cmd_handle_t) cmd_desc;
}



/** to stage 2 module!??
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_cmd_link_delete
 *  Desc: Frees linked list: All linked list elements + head
 *  Info: 
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *  Rets: -/-
 * -------------------------------------------------------------------------------------------------
 */
void
i2c_cmd_link_delete(i2c_cmd_handle_t cmd_handle)
{
  // is it a valid handle ?
  if (cmd_handle == NULL) {

	return;
  }

