mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
  // get ptr to linked list head 
  i2c_cmd_desc_t *cmd = (i2c_cmd_desc_t*) cmd_handle;

  // loop throug the linked list elements and free them
  while (cmd->free) {

	i2c_cmd_link_t* ptmp = cmd->free;

	cmd->free = cmd->free->next;

	free(ptmp);
  }

  // makes no sense? its freed...
  cmd->cur = NULL;
  cmd->free = NULL;
  cmd->head = NULL;

  // free the head of the linked list
  free(cmd_handle);

  return;
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_cmd_link_append
 *  Desc: Append to linked list: Adds a command i2c_cmd_t at the given ptr to the linked i2c cmd list
 *  Info: 
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *        i2c_cmd_t* cmd -> ptr to the cmd data (data will be copied to allocated memory)
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
static esp_err_t
i2c_cmd_link_append(i2c_cmd_handle_t cmd_handle,
	i2c_cmd_t *cmd)
{
  // get ptr to linked list head 
  i2c_cmd_desc_t* cmd_desc = (i2c_cmd_desc_t*) cmd_handle;

  // is this the first element? (new list)
  if (cmd_desc->head == NULL) {

	#if !CONFIG_SPIRAM_USE_MALLOC
        cmd_desc->head = (i2c_cmd_link_t*) calloc(1, sizeof(i2c_cmd_link_t));
	#else
        cmd_desc->head = (i2c_cmd_link_t*) heap_caps_calloc(1, sizeof(i2c_cmd_link_t), MALLOC_CAP_INTERNAL|MALLOC_CAP_8BIT);
	#endif

	// alloc error
	if (cmd_desc->head == NULL) {

		ESP_LOGE(I2C_TAG, I2C_CMD_MALLOC_ERR_STR);

		goto err;
	}

	// initialize - the first -
	cmd_desc->cur = cmd_desc->head;
	cmd_desc->free = cmd_desc->head;

	// there are already elements in the linked list ..
  } else {

	#if !CONFIG_SPIRAM_USE_MALLOC
        cmd_desc->cur->next = (i2c_cmd_link_t*) calloc(1, sizeof(i2c_cmd_link_t));
	#else
        cmd_desc->cur->next = (i2c_cmd_link_t*) heap_caps_calloc(1, sizeof(i2c_cmd_link_t), MALLOC_CAP_INTERNAL|MALLOC_CAP_8BIT);
	#endif

	// alloc error
	if (cmd_desc->cur->next == NULL) {

		ESP_LOGE(I2C_TAG, I2C_CMD_MALLOC_ERR_STR);

		goto err;
	}

	// update new last list element in head
	cmd_desc->cur = cmd_desc->cur->next;
  }

  // now copy the i2c command data to allocated memory
  memcpy((uint8_t*) &cmd_desc->cur->cmd, (uint8_t*) cmd, sizeof(i2c_cmd_t));

  // and initialize the next field in this list element
  cmd_desc->cur->next = NULL;

  return ESP_OK;

  err:

  return ESP_FAIL;
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_start
 *  Desc: Append to linked list: initial start cmd with cmd.op_code = I2C_CMD_START 
 *  Info: This should be first element in a i2c cmd linked list
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_master_start(i2c_cmd_handle_t cmd_handle)
{
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = 0;
  cmd.ack_exp = 0;
  cmd.ack_val = 0;
  cmd.byte_num = 0;
  cmd.data = NULL;
  cmd.op_code = I2C_CMD_RESTART;

  return i2c_cmd_link_append(cmd_handle, &cmd);
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_stop
 *  Desc: Append to linked list: final stop cmd with cmd.op_code = I2C_CMD_STOP 
 *  Info: This should finalize a i2c cmd linked list
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t
i2c_master_stop(i2c_cmd_handle_t cmd_handle)
{
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = 0;
  cmd.ack_exp = 0;
  cmd.ack_val = 0;
  cmd.byte_num = 0;
  cmd.data = NULL;
  cmd.op_code = I2C_CMD_STOP;

  return i2c_cmd_link_append(cmd_handle, &cmd);
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_write
 *  Desc: append to linked list: write len bytes from source ptr to master cmd with 
 *        cmd.op_code = I2C_CMD_WRITE
 *  Info:
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *        uint8_t* data -> source ptr to bytes to write
 *        size_t data_len -> number of bytes to write
 *        bool ack_en ->
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_master_write(i2c_cmd_handle_t cmd_handle,
	uint8_t *data,
	size_t data_len,
	bool ack_en)
{
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  uint8_t len_tmp;

  int data_offset = 0;

  esp_err_t ret;

  while (data_len > 0) {

    len_tmp = data_len > 0xff ? 0xff : data_len;
    data_len -= len_tmp;

    i2c_cmd_t cmd;

    cmd.ack_en = ack_en;
    cmd.ack_exp = 0;
    cmd.ack_val = 0;
    cmd.byte_num = len_tmp;
    cmd.op_code = I2C_CMD_WRITE;
    cmd.data = data + data_offset;

    ret = i2c_cmd_link_append(cmd_handle, &cmd);

    data_offset += len_tmp;

    if (ret != ESP_OK) {

      return ret;
    }
  }

  return ESP_OK;
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_write_byte
 *  Desc: append to linked list: write the given byte to master cmd with cmd.op_code = I2C_CMD_WRITE
 *  Info:
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *        uint8_t data -> the byte to write
 *        bool ack_en ->
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_master_write_byte(i2c_cmd_handle_t cmd_handle,
	uint8_t data,
	bool ack_en)
{
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = ack_en;
  cmd.ack_exp = 0;
  cmd.ack_val = 0;
  cmd.byte_num = 1;
  cmd.op_code = I2C_CMD_WRITE;
  cmd.data = NULL;
  cmd.byte_cmd = data;

  return i2c_cmd_link_append(cmd_handle, &cmd);
}



static esp_err_t 
i2c_master_read_static(i2c_cmd_handle_t cmd_handle, uint8_t* data,
	size_t data_len,
	i2c_ack_type_t ack)
{
  int len_tmp;
  int data_offset = 0;
  esp_err_t ret;

  while (data_len > 0) {

	len_tmp = data_len > 0xff ? 0xff : data_len;
	data_len -= len_tmp;
	i2c_cmd_t cmd;
	cmd.ack_en = 0;
	cmd.ack_exp = 0;
	cmd.ack_val = ack & 0x1;
	cmd.byte_num = len_tmp;
	cmd.op_code = I2C_CMD_READ;
	cmd.data = data + data_offset;

	ret = i2c_cmd_link_append(cmd_handle, &cmd);

