mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
	data_offset += len_tmp;

	if (ret != ESP_OK) {

		return ret;
	}
  }

  return ESP_OK;
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_read_byte
 *  Desc: Append to linked list: Operation "Read one byte from master"
 *        - build operation "read one byte from master via cmd.op_code = I2C_CMD_READ"
 *          to the data destination adress
 *        - append this operation to linked list
 *  Info:
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *        uint8_t* data -> destination ptr for the byte to read
 *        i2c_ack_type_t ack ->
 *  Rets: esp_err_t -> from "i2c_cmd_link_append" FN
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t
i2c_master_read_byte(i2c_cmd_handle_t cmd_handle
	,uint8_t *data
	,i2c_ack_type_t ack)
{
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(ack < I2C_MASTER_ACK_MAX, I2C_ACK_TYPE_ERR_STR, ESP_ERR_INVALID_ARG);

  i2c_cmd_t cmd;

  cmd.ack_en = 0;
  cmd.ack_exp = 0;
  cmd.ack_val = ((ack == I2C_MASTER_LAST_NACK) ? I2C_MASTER_NACK : (ack & 0x1));
  cmd.byte_num = 1;
  cmd.op_code = I2C_CMD_READ;
  cmd.data = data;

  return i2c_cmd_link_append(cmd_handle, &cmd);
}



/** to stage 2 module!
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_read
 *  Desc: append to linked list: read len bytes from master cmd with cmd.op_code = I2C_CMD_READ
 *        to the data destinstion adress
 *  Info:
 *  Para: i2c_cmd_handle_t cmd_handle -> head of linked list - i2c commands
 *        uint8_t* data -> ptr to the bytes to write
 *        size_t data_len -> no. of bytes to write
 *        int ack ->
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t 
i2c_master_read(i2c_cmd_handle_t cmd_handle
	,uint8_t *data
	,size_t data_len
	,i2c_ack_type_t ack)
{
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(ack < I2C_MASTER_ACK_MAX, I2C_ACK_TYPE_ERR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(data_len > 0, I2C_DATA_LEN_ERR_STR, ESP_ERR_INVALID_ARG);

  if(ack != I2C_MASTER_LAST_NACK) {

	return i2c_master_read_static(cmd_handle, data, data_len, ack);

  } else {

	if(data_len == 1) {

		return i2c_master_read_byte(cmd_handle, data, I2C_MASTER_NACK);

	} else {

		esp_err_t ret;

		if ((ret =  i2c_master_read_static(cmd_handle, data, data_len - 1, I2C_MASTER_ACK)) != ESP_OK) {

                	return ret;

		}

		return i2c_master_read_byte(cmd_handle, data + data_len - 1, I2C_MASTER_NACK);
	}
  }
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_cmd_begin_static
 *  Desc: 
 *  Info: RUNS IN INTERRUPT !
 *  Para: i2c_obj_t *p_i2c -> ptr to the i2c processing object for this i2c num
 *  Rets: void
 * -------------------------------------------------------------------------------------------------
 */
static void IRAM_ATTR 
i2c_master_cmd_begin_static(i2c_obj_t* p_i2c)
{
  // get the assigned i2c num.
  int i2c_num = p_i2c->i2c_num;

  portBASE_TYPE HPTaskAwoken = pdFALSE;

  i2c_cmd_evt_t evt;

  //This should never happen
  if (p_i2c->mode == I2C_MODE_SLAVE) {

	return;
  }

  if (p_i2c->status == I2C_STATUS_DONE) {
	return;
  } else if ((p_i2c->status == I2C_STATUS_ACK_ERROR)
		|| (p_i2c->status == I2C_STATUS_TIMEOUT)) {

	I2C[i2c_num]->int_ena.end_detect = 0;
	I2C[i2c_num]->int_clr.end_detect = 1;

	if(p_i2c->status == I2C_STATUS_TIMEOUT) {
		I2C[i2c_num]->int_clr.time_out = 1;
		I2C[i2c_num]->int_ena.val = 0;
	}

	evt.type = I2C_CMD_EVT_DONE;
	xQueueOverwriteFromISR(p_i2c->cmd_evt_queue, &evt, &HPTaskAwoken);

	if (HPTaskAwoken == pdTRUE) {

		portYIELD_FROM_ISR();
	}

	return;

  } else if (p_i2c->cmd_link.head != NULL && p_i2c->status == I2C_STATUS_READ) {

	i2c_cmd_t *cmd = &p_i2c->cmd_link.head->cmd;

	while (p_i2c->rx_cnt-- > 0) {

		*cmd->data++ = READ_PERI_REG(I2C_DATA_APB_REG(i2c_num));
	}

	if (cmd->byte_num > 0) {

		p_i2c->rx_fifo_remain = I2C_FIFO_LEN;
		p_i2c->cmd_idx = 0;

	} else {

		p_i2c->cmd_link.head = p_i2c->cmd_link.head->next;
	}
  }

  if (p_i2c->cmd_link.head == NULL) {
        p_i2c->cmd_link.cur = NULL;
        evt.type = I2C_CMD_EVT_DONE;
        xQueueOverwriteFromISR(p_i2c->cmd_evt_queue, &evt, &HPTaskAwoken);
        if (HPTaskAwoken == pdTRUE) {
            portYIELD_FROM_ISR();
        }
        // Return to the IDLE status after cmd_eve_done signal were send out.
        p_i2c->status = I2C_STATUS_IDLE;
        return;
	}

	while (p_i2c->cmd_link.head) {

		i2c_cmd_t *cmd = &p_i2c->cmd_link.head->cmd;

		I2C[i2c_num]->command[p_i2c->cmd_idx].val = 0;
		I2C[i2c_num]->command[p_i2c->cmd_idx].ack_en = cmd->ack_en;
		I2C[i2c_num]->command[p_i2c->cmd_idx].ack_exp = cmd->ack_exp;
		I2C[i2c_num]->command[p_i2c->cmd_idx].ack_val = cmd->ack_val;
		I2C[i2c_num]->command[p_i2c->cmd_idx].byte_num = cmd->byte_num;
		I2C[i2c_num]->command[p_i2c->cmd_idx].op_code = cmd->op_code;

		if (cmd->op_code == I2C_CMD_WRITE) {
			uint32_t wr_filled = 0;

		//TODO: to reduce interrupt number
		if (cmd->data) {
			while (p_i2c->tx_fifo_remain > 0 && cmd->byte_num > 0) {
				WRITE_PERI_REG(I2C_DATA_APB_REG(i2c_num), *cmd->data++);
				p_i2c->tx_fifo_remain--;
				cmd->byte_num--;
				wr_filled++;
			}
		} else {
			WRITE_PERI_REG(I2C_DATA_APB_REG(i2c_num), cmd->byte_cmd);
			p_i2c->tx_fifo_remain--;
			cmd->byte_num--;
			wr_filled ++;
		}
		// Workaround for register field operation.
		I2C[i2c_num]->command[p_i2c->cmd_idx].byte_num = wr_filled;
		I2C[i2c_num]->command[p_i2c->cmd_idx + 1].val = 0;
		I2C[i2c_num]->command[p_i2c->cmd_idx + 1].op_code = I2C_CMD_END;
		p_i2c->tx_fifo_remain = I2C_FIFO_LEN;
		p_i2c->cmd_idx = 0;

		if (cmd->byte_num > 0) {

		} else {

			p_i2c->cmd_link.head = p_i2c->cmd_link.head->next;
		}

		p_i2c->status = I2C_STATUS_WRITE;

		break;

