mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
	} else if (cmd->op_code == I2C_CMD_READ) {

		//TODO: to reduce interrupt number
		p_i2c->rx_cnt = 
			cmd->byte_num > p_i2c->rx_fifo_remain ? p_i2c->rx_fifo_remain : cmd->byte_num;

		cmd->byte_num -= p_i2c->rx_cnt;
		I2C[i2c_num]->command[p_i2c->cmd_idx].byte_num = p_i2c->rx_cnt;
		I2C[i2c_num]->command[p_i2c->cmd_idx].ack_val = cmd->ack_val;
		I2C[i2c_num]->command[p_i2c->cmd_idx + 1].val = 0;
		I2C[i2c_num]->command[p_i2c->cmd_idx + 1].op_code = I2C_CMD_END;
		p_i2c->status = I2C_STATUS_READ;
		break;

	} else {
	}

	p_i2c->cmd_idx++;

	p_i2c->cmd_link.head = p_i2c->cmd_link.head->next;

	if (p_i2c->cmd_link.head == NULL || p_i2c->cmd_idx >= 15) {

		p_i2c->tx_fifo_remain = I2C_FIFO_LEN;

		p_i2c->cmd_idx = 0;

		break;
	}
  }

  I2C[i2c_num]->int_clr.end_detect = 1;
  I2C[i2c_num]->int_ena.end_detect = 1;
  I2C[i2c_num]->ctr.trans_start = 0;
  I2C[i2c_num]->ctr.trans_start = 1;

  return;
}



/**
 * -------------------------------------------------------------------------------------------------
 *  FName: i2c_master_cmd_begin
 *  Desc: Starts the processing of the i2c command linked list. Will continue in interrupt
 *  Info: NOT called from interrupt
 *  Para: i2c_obj_t *p_i2c -> ptr to the i2c processing object for this i2c num
 *        i2c_cmd_handle_t cmd_handle -> head of linked list that stores the i2c commands
 *        portBASE_TYPE ticks_to_wait -> ???
 *  Rets: esp_err_t ->
 * -------------------------------------------------------------------------------------------------
 */
esp_err_t
i2c_master_cmd_begin(i2c_obj_t *p_i2c,
	i2c_cmd_handle_t cmd_handle,
	TickType_t ticks_to_wait)
{
  // get the assigned i2c num.
  int i2c_num = p_i2c->i2c_num;

  I2C_CHECK(( i2c_num < I2C_NUM_MAX ), I2C_NUM_ERROR_STR, ESP_ERR_INVALID_ARG);
  I2C_CHECK(p_i2c != NULL, I2C_DRIVER_NOT_INSTALL_ERR_STR, ESP_ERR_INVALID_STATE);
  I2C_CHECK(p_i2c->mode == I2C_MODE_MASTER, I2C_MASTER_MODE_ERR_STR, ESP_ERR_INVALID_STATE);
  I2C_CHECK(cmd_handle != NULL, I2C_CMD_LINK_INIT_ERR_STR, ESP_ERR_INVALID_ARG);

  #if CONFIG_SPIRAM_USE_MALLOC
  //If the i2c read or write buffer is not in internal RAM, we will return ESP_FAIL
  //to avoid the ISR handler function crashing when the cache is disabled.

  if( (p_i2c_obj[i2c_num]->intr_alloc_flags & ESP_INTR_FLAG_IRAM) ) {

	if( !is_cmd_link_buffer_internal(((i2c_cmd_desc_t*)cmd_handle)->head) ) {

		ESP_LOGE(I2C_TAG, I2C_PSRAM_BUFFER_WARN_STR);

		return ESP_ERR_INVALID_ARG;
	}
  }
  #endif

  // Sometimes when the FSM get stuck, the ACK_ERR interrupt will occur endlessly until we reset the FSM and clear bus.
  static uint8_t clear_bus_cnt = 0;

  esp_err_t ret = ESP_FAIL;

  portTickType ticks_start = xTaskGetTickCount();

  portBASE_TYPE res = xSemaphoreTake(p_i2c->cmd_mux, ticks_to_wait);

  if (res == pdFALSE) {

	return ESP_ERR_TIMEOUT;
  }

  xQueueReset(p_i2c->cmd_evt_queue);

  if (p_i2c->status == I2C_STATUS_TIMEOUT
	|| I2C[i2c_num]->status_reg.bus_busy == 1) {

	i2c_hw_fsm_reset(i2c_num);

	clear_bus_cnt = 0;
  }

  i2c_reset_tx_fifo(i2c_num);
  i2c_reset_rx_fifo(i2c_num);

  i2c_cmd_desc_t* cmd = (i2c_cmd_desc_t*) cmd_handle;

  p_i2c->cmd_link.free = cmd->free;
  p_i2c->cmd_link.cur = cmd->cur;
  p_i2c->cmd_link.head = cmd->head;
  p_i2c->status = I2C_STATUS_IDLE;
  p_i2c->cmd_idx = 0;
  p_i2c->rx_cnt = 0;

  p_i2c->tx_fifo_remain = I2C_FIFO_LEN;
  p_i2c->rx_fifo_remain = I2C_FIFO_LEN;

  i2c_reset_tx_fifo(i2c_num);
  i2c_reset_rx_fifo(i2c_num);

  // These two interrupts some times can not be cleared when the FSM gets stuck.
  // so we disable them when these two interrupt occurs and re-enable them here.
  I2C[i2c_num]->int_ena.ack_err = 1;
  I2C[i2c_num]->int_ena.time_out = 1;

  //start send commands, at most 32 bytes one time, isr handler will process the remaining commands.
  i2c_master_cmd_begin_static(p_i2c);

  // Wait event bits
  i2c_cmd_evt_t evt;

  while (1) {

	TickType_t wait_time = xTaskGetTickCount();

	if (wait_time - ticks_start > ticks_to_wait) { // out of time

		wait_time = I2C_CMD_ALIVE_INTERVAL_TICK;

	} else {

		wait_time = ticks_to_wait - (wait_time - ticks_start);

		if (wait_time < I2C_CMD_ALIVE_INTERVAL_TICK) {

			wait_time = I2C_CMD_ALIVE_INTERVAL_TICK;
		}
	}

	// In master mode, since we don't have an interrupt to detective bus error or FSM state, what we do here is to make
	// sure the interrupt mechanism for master mode is still working.
	// If the command sending is not finished and there is no interrupt any more, the bus is probably dead caused by external noise.
	portBASE_TYPE evt_res = xQueueReceive(p_i2c->cmd_evt_queue, &evt, wait_time);

	if (evt_res == pdTRUE) {

		if (evt.type == I2C_CMD_EVT_DONE) {

			if (p_i2c->status == I2C_STATUS_TIMEOUT) {

 				// If the I2C slave are powered off or the SDA/SCL are connected to ground, for example,
				// I2C hw FSM would get stuck in wrong state, we have to reset the I2C module in this case.
				i2c_hw_fsm_reset(i2c_num);

				clear_bus_cnt = 0;

				ret = ESP_ERR_TIMEOUT;

			} else if (p_i2c->status == I2C_STATUS_ACK_ERROR) {

				clear_bus_cnt++;

				if(clear_bus_cnt >= I2C_ACKERR_CNT_MAX) {

					i2c_master_clear_bus(i2c_num);

					clear_bus_cnt = 0;
				}

			ret = ESP_FAIL;

			} else {

				ret = ESP_OK;
			}

			break;
		}

		if (evt.type == I2C_CMD_EVT_ALIVE) {

		}

	} else {

	ret = ESP_ERR_TIMEOUT;

	// If the I2C slave are powered off or the SDA/SCL are connected to ground, for example,
	// I2C hw FSM would get stuck in wrong state, we have to reset the I2C module in this case.
	i2c_hw_fsm_reset(i2c_num);

	clear_bus_cnt = 0;

	break;
	}
  }

  p_i2c->status = I2C_STATUS_DONE;

  xSemaphoreGive(p_i2c->cmd_mux);

  return ret;
}



int 
i2c_slave_write_buffer(i2c_obj_t *p_i2c,
	uint8_t* data,
	int size,
	TickType_t ticks_to_wait)

{
  i2c_port_t i2c_num = p_i2c->i2c_num;

  I2C_CHECK(( i2c_num < I2C_NUM_MAX ), I2C_NUM_ERROR_STR, ESP_FAIL);
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_FAIL);
  I2C_CHECK(p_i2c->mode == I2C_MODE_SLAVE, I2C_MODE_SLAVE_ERR_STR, ESP_FAIL);

  portBASE_TYPE res;

  int cnt = 0;

  portTickType ticks_end = xTaskGetTickCount() + ticks_to_wait;

  res = xSemaphoreTake(p_i2c->slv_tx_mux, ticks_to_wait);

  if (res == pdFALSE) {

