mattehicks/SCDE/components/ESP32_I2C_Master_Module/ESP32_I2C_Master_Module.c
	return 0;
  }

  ticks_to_wait = ticks_end - xTaskGetTickCount();

  res = xRingbufferSend(p_i2c->tx_ring_buf, data, size, ticks_to_wait);

  if (res == pdFALSE) {

	cnt = 0;

  } else {

	I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

	I2C[i2c_num]->int_clr.tx_fifo_empty = 1;

	I2C[i2c_num]->int_ena.tx_fifo_empty = 1;

	I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

	cnt = size;
  }

  xSemaphoreGive(p_i2c->slv_tx_mux);

  return cnt;
}



static 
int i2c_slave_read(i2c_obj_t* p_i2c,
	uint8_t* data,
	size_t max_size,
	TickType_t ticks_to_wait)

{
  i2c_port_t i2c_num = p_i2c->i2c_num;

  size_t size = 0;

  uint8_t* pdata = (uint8_t*) xRingbufferReceiveUpTo(p_i2c->rx_ring_buf, &size, ticks_to_wait, max_size);

  if (pdata && size > 0) {

	memcpy(data, pdata, size);

	vRingbufferReturnItem(p_i2c->rx_ring_buf, pdata);
  }

  return size;
}



int 
i2c_slave_read_buffer(i2c_obj_t* p_i2c,
	uint8_t* data,
	size_t max_size,
	TickType_t ticks_to_wait)
{
  i2c_port_t i2c_num = p_i2c->i2c_num;

  I2C_CHECK(( i2c_num < I2C_NUM_MAX ), I2C_NUM_ERROR_STR, ESP_FAIL);
  I2C_CHECK((data != NULL), I2C_ADDR_ERROR_STR, ESP_FAIL);
  I2C_CHECK(p_i2c->mode == I2C_MODE_SLAVE, I2C_MODE_SLAVE_ERR_STR, ESP_FAIL);

  portBASE_TYPE res;

  portTickType ticks_end = xTaskGetTickCount() + ticks_to_wait;

  res = xSemaphoreTake(p_i2c->slv_rx_mux, ticks_to_wait);

  if (res == pdFALSE) {

	return 0;
  }

  ticks_to_wait = ticks_end - xTaskGetTickCount();

  int cnt = i2c_slave_read(p_i2c, data, max_size, ticks_to_wait);

  if (cnt > 0) {

	I2C_ENTER_CRITICAL(&i2c_spinlock[i2c_num]);

	I2C[i2c_num]->int_ena.rx_fifo_full = 1;

	I2C_EXIT_CRITICAL(&i2c_spinlock[i2c_num]);

	ticks_to_wait = ticks_end - xTaskGetTickCount();

	if (cnt < max_size && ticks_to_wait > 0) {

		cnt += i2c_slave_read(p_i2c, data + cnt, max_size - cnt, ticks_to_wait);
		}

	} else {

	cnt = 0;

  }

  xSemaphoreGive(p_i2c->slv_rx_mux);

  return cnt;
}




